[
  {
    "id": "_nhem3j4v8",
    "category": "Home",
    "title": "Inferno Malware Masqueraded as Coinbase, Drained $87 Million from 137,000 Victims",
    "date": "2024-01-16T13:29:00+05:30",
    "author": "Newsroom",
    "pTags": "Cryptocurrency / Cyber Threat",
    "imgLinks": [
      "_1u5a0ctv3"
    ],
    "contentEn": "<p>The operators behind the now-defunct <strong>Inferno Drainer</strong> created more than 16,000 unique malicious domains over a span of one year between 2022 and 2023.</p><p>The scheme \"leveraged high-quality phishing pages to lure unsuspecting users into connecting their cryptocurrency wallets with the attackers' infrastructure that spoofed Web3 protocols to trick victims into authorizing transactions,\" Singapore-headquartered Group-IB  in a report shared with The Hacker News.</p><p>Inferno Drainer, which was active from , is estimated to have reaped over  by scamming more than 137,000 victims.</p><p>The malware is part of a broader set of similar offerings that are available to affiliates under the scam-as-a-service (or drainer-as-a-service) model in exchange for a 20% cut of their earnings.</p><p>What's more, customers of Inferno Drainer could either upload the malware to their own phishing sites, or make use of the developer's service for creating and hosting phishing websites, either at no extra cost or charging 30% of the stolen assets in some cases.</p><p>According to Group-IB, the activity spoofed upwards of 100 cryptocurrency brands via specially crafted pages that were hosted on over 16,000 unique domains.</p><p>Further analysis of 500 of these domains has revealed that the JavaScript-based drainer was hosted initially on a GitHub repository (kuzdaz.github[.]io/seaport/seaport.js) before incorporating them directly on the websites. The user \"kuzdaz\" currently does not exist.</p><p>In a similar fashion, another set of 350 sites included a JavaScript file, \"coinbase-wallet-sdk.js,\" on a different GitHub repository, \"kasrlorcian.github[.]io.\"</p><p>These sites were then propagated on sites like Discord and X (formerly Twitter), enticing potential victims into clicking them under the guise of offering free tokens (aka airdrops) and connecting their wallets, at which point their assets are drained once the transactions are approved.</p><p>In using the names seaport.js, coinbase.js and wallet-connect.js, the idea was to masquerade as popular Web3 protocols like Seaport, WalletConnect, and Coinbase to complete the unauthorized transactions. The earliest website containing one of these scripts dates back to May 15, 2023.</p><p>\"Another typical feature of phishing websites belonging to Inferno Drainer was that users cannot open website source code by using hotkeys or right-clicking on the mouse,\" Group-IB analyst Viacheslav Shevchenko said. \"This means that the criminals attempted to hide their scripts and illegal activity from their victims.\"</p><p>It's worth noting that Google-owned Mandiant's X account was  earlier this month to distribute links to a phishing page hosting a cryptocurrency drainer tracked as CLINKSINK.</p><p>“We believe that the ‘X as a service’ model will continue to thrive, not least because it creates greater opportunities for less technically competent individuals from trying their hand at becoming cybercriminals, and for developers, it is a highly profitable way to bolster their revenues,” the company told The Hacker News.</p><p>“We also expect to see increased attempts at hacking official accounts, as posts purportedly authored by an authoritative voice are likely to inspire trust in the eyes of viewers, and may make potential victims more likely to follow links and connect their accounts.”</p><p>On top of that, Group-IB said the success of Inferno Drainer could fuel the development of new drainers as well as lead to a surge in websites containing malicious scripts spoofing Web3 protocols, noting 2024 could become the “year of the drainer.”</p><p>\"Inferno Drainer may have ceased its activity, but its prominence throughout 2023 highlights the severe risks to cryptocurrency holders as drainers continue to develop further,\" Andrey Kolmakov, head of Group-IB's High-Tech Crime Investigation Department, said.</p>",
    "ref": "https://thehackernews.com/2024/01/inferno-malware-masqueraded-as-coinbase.html",
    "titleTh": "มัลแวร์ Inferno สวมหน้ากากเป็น Coinbase ระบายเงิน 87 ล้านดอลลาร์จากเหยื่อ 137,000 ราย",
    "contentTh": "<p>ผู้ดำเนินการที่อยู่เบื้องหลัง <strong>Inferno Drainer</strong> ที่เลิกใช้งานไปแล้วได้สร้างโดเมนที่เป็นอันตรายมากกว่า 16,000 โดเมนในช่วงหนึ่งปีระหว่างปี 2022 ถึง 2023</p><p> โครงการ “ใช้ประโยชน์จากหน้าฟิชชิ่งคุณภาพสูงเพื่อล่อลวงผู้ใช้ที่ไม่สงสัยให้เชื่อมต่อกระเป๋าเงินดิจิตอลของพวกเขากับโครงสร้างพื้นฐานของผู้โจมตีที่ปลอมแปลงโปรโตคอล Web3 เพื่อหลอกเหยื่อให้อนุญาตการทำธุรกรรม” Group-IB ซึ่งมีสำนักงานใหญ่ในสิงคโปร์ในรายงานที่แชร์กับ The Hacker News</p><p> Inferno Drainer ซึ่งเริ่มทำงานจาก คาดว่าจะได้ผลโดยการหลอกลวงเหยื่อมากกว่า 137,000 ราย</p><p> มัลแวร์เป็นส่วนหนึ่งของชุดข้อเสนอที่คล้ายกันในวงกว้างซึ่งมีให้บริการสำหรับบริษัทในเครือภายใต้รูปแบบการหลอกลวงแบบบริการ (หรือแบบ Drainer-as-a-Service) เพื่อแลกกับการลดรายได้ลง 20%</p><p> ยิ่งไปกว่านั้น ลูกค้าของ Inferno Drainer ยังสามารถอัปโหลดมัลแวร์ไปยังไซต์ฟิชชิ่งของตนเอง หรือใช้บริการของนักพัฒนาเพื่อสร้างและโฮสต์เว็บไซต์ฟิชชิ่ง โดยไม่มีค่าใช้จ่ายเพิ่มเติมหรือเรียกเก็บเงิน 30% ของทรัพย์สินที่ถูกขโมยในบางกรณี</p><p> ตามข้อมูลของ Group-IB กิจกรรมดังกล่าวเป็นการปลอมแปลงแบรนด์ cryptocurrency กว่า 100 แบรนด์ผ่านเพจที่สร้างขึ้นเป็นพิเศษซึ่งโฮสต์บนโดเมนที่ไม่ซ้ำกันมากกว่า 16,000 โดเมน</p><p> การวิเคราะห์เพิ่มเติมของโดเมนเหล่านี้ 500 โดเมนได้เปิดเผยว่า Drainer ที่ใช้ JavaScript นั้นถูกโฮสต์ครั้งแรกบนที่เก็บ GitHub (kuzdaz.github[.]io/seaport/seaport.js) ก่อนที่จะรวมเข้ากับเว็บไซต์โดยตรง ไม่มีผู้ใช้ &quot;kuzdaz&quot; อยู่ในขณะนี้</p><p> ในทำนองเดียวกัน เว็บไซต์อีกชุดจำนวน 350 แห่งได้รวมไฟล์ JavaScript &quot;coinbase-wallet-sdk.js&quot; ไว้ในที่เก็บ GitHub อื่น &quot;kasrlorcian.github[.]io&quot;</p><p> ไซต์เหล่านี้ได้รับการเผยแพร่บนเว็บไซต์เช่น Discord และ X (เดิมคือ Twitter) เพื่อล่อลวงผู้ที่ตกเป็นเหยื่อให้คลิกพวกเขาภายใต้หน้ากากของการเสนอโทเค็นฟรี (aka airdrops) และเชื่อมต่อกระเป๋าเงินของพวกเขา ซึ่ง ณ จุดนี้ทรัพย์สินของพวกเขาจะหมดลงเมื่อธุรกรรมได้รับการอนุมัติ .</p><p> ในการใช้ชื่อ seaport.js, coinbase.js และ wallet-connect.js แนวคิดคือการปลอมแปลงเป็นโปรโตคอล Web3 ยอดนิยม เช่น Seaport, WalletConnect และ Coinbase เพื่อทำธุรกรรมที่ไม่ได้รับอนุญาตให้เสร็จสิ้น เว็บไซต์แรกสุดที่มีสคริปต์เหล่านี้มีอายุย้อนกลับไปวันที่ 15 พฤษภาคม 2023</p><p> “คุณสมบัติทั่วไปอีกประการหนึ่งของเว็บไซต์ฟิชชิ่งที่เป็นของ Inferno Drainer คือผู้ใช้ไม่สามารถเปิดซอร์สโค้ดของเว็บไซต์ได้โดยใช้ปุ่มลัดหรือคลิกขวาบนเมาส์” นักวิเคราะห์ Group-IB Viacheslav Shevchenko กล่าว “ซึ่งหมายความว่าอาชญากรพยายามซ่อนสคริปต์และกิจกรรมที่ผิดกฎหมายจากเหยื่อ”</p><p> เป็นที่น่าสังเกตว่าบัญชี X ของ Mandiant ที่ Google เป็นเจ้าของนั้นได้เปิดใช้งานเมื่อต้นเดือนนี้เพื่อเผยแพร่ลิงก์ไปยังหน้าฟิชชิ่งที่โฮสต์ตัวระบายสกุลเงินดิจิทัลที่ถูกติดตามในชื่อ CLINKSINK</p><p> “เราเชื่อว่าโมเดล &#39;X as a service&#39; จะยังคงเติบโตต่อไป ไม่น้อยเพราะมันสร้างโอกาสที่มากขึ้นให้กับบุคคลที่มีความสามารถทางเทคนิคน้อยจากการพยายามกลายเป็นอาชญากรไซเบอร์ และสำหรับนักพัฒนา โมเดลนี้เป็นวิธีที่สร้างผลกำไรสูงในการสนับสนุนพวกเขา รายได้” บริษัทบอกกับ The Hacker News</p><p> “เรายังคาดหวังว่าจะเห็นความพยายามเพิ่มขึ้นในการแฮ็กบัญชีอย่างเป็นทางการ เนื่องจากโพสต์ที่อ้างว่าเขียนด้วยเสียงที่เชื่อถือได้มีแนวโน้มที่จะสร้างแรงบันดาลใจให้เกิดความไว้วางใจในสายตาของผู้ดู และอาจทำให้ผู้ที่ตกเป็นเหยื่อมีแนวโน้มที่จะติดตามลิงก์และเชื่อมโยงบัญชีของพวกเขามากขึ้น”</p><p> ยิ่งไปกว่านั้น Group-IB ยังกล่าวอีกว่าความสำเร็จของ Inferno Drainer สามารถกระตุ้นการพัฒนา Drainer ใหม่ได้ รวมถึงนำไปสู่การเพิ่มจำนวนเว็บไซต์ที่มีสคริปต์ที่เป็นอันตรายซึ่งปลอมแปลงโปรโตคอล Web3 โดยสังเกตว่าปี 2024 อาจกลายเป็น “ปีแห่งการระบายน้ำ”</p><p> Andrey Kolmakov หัวหน้าแผนกสืบสวนอาชญากรรมเทคโนโลยีขั้นสูงของ Group-IB กล่าวว่า &quot;Inferno Drainer อาจหยุดกิจกรรมไปแล้ว แต่ความโดดเด่นตลอดปี 2023 เน้นย้ำถึงความเสี่ยงที่รุนแรงต่อผู้ถือครองสกุลเงินดิจิทัล เนื่องจากผู้ระบายน้ำยังคงพัฒนาต่อไป&quot;</p>"
  },
  {
    "id": "_3u1us9tg4",
    "category": "Home",
    "title": "Hackers Weaponize Windows Flaw to Deploy Crypto-Siphoning Phemedrone Stealer",
    "date": "2024-01-16T12:43:00+05:30",
    "author": "Newsroom",
    "pTags": "Cryptocurrency / Windows Security",
    "imgLinks": [
      "_a7kl9nfnj"
    ],
    "contentEn": "<p>Threat actors have been observed leveraging a now-patched security flaw in Microsoft Windows to deploy an open-source information stealer called <strong>Phemedrone Stealer</strong>.</p><p>\"Phemedrone targets web browsers and data from cryptocurrency wallets and messaging apps such as Telegram, Steam, and Discord,\" Trend Micro researchers Peter Girnus, Aliakbar Zahravi, and Simon Zuckerbraun .</p><p>\"It also takes screenshots and gathers system information regarding hardware, location, and operating system details. The stolen data is then sent to the attackers via Telegram or their command-and-control (C&amp;C) server.\"</p><p>The attacks leverage  (CVSS score: 8.8), a security bypass vulnerability in Windows SmartScreen, that could be exploited by tricking a user into clicking on a specially crafted Internet Shortcut (.URL) or a hyperlink pointing to an Internet Shortcut file.</p><p>The actively-exploited shortcoming was  by Microsoft as part of its November 2023 Patch Tuesday updates.</p><p>The infection process involves the threat actor hosting malicious Internet Shortcut files on Discord or cloud services like FileTransfer.io, with the links also masked using URL shorteners such as .</p><p>The execution of the booby-trapped .URL file allows it to connect to an actor-controlled server and execute a control panel (.CPL) file in a manner that circumvents Windows Defender SmartScreen by taking advantage of CVE-2023-36025.</p><p>\"When the malicious .CPL file is executed through the Windows Control Panel process binary, it in turn calls rundll32.exe to execute the DLL,\" the researchers said. \"This malicious DLL acts as a loader that then calls on Windows PowerShell to download and execute the next stage of the attack, hosted on GitHub.\"</p><p>The follow-on payload is a PowerShell loader (\"DATA3.txt\") that acts as a launchpad for , an open-source shellcode loader that decrypts and executes Phemedrone Stealer.</p><p>Written in C#, Phemedrone Stealer is actively maintained by its developers on  and , facilitating the theft of sensitive information from compromised systems.</p><p>The development is once again a sign that threat actors are getting increasingly flexible and quickly adapting their attack chains to capitalize on newly disclosed exploits and inflict maximum damage.</p><p>\"Despite having been patched, threat actors continue to find ways to exploit CVE-2023-36025 and evade Windows Defender SmartScreen protections to infect users with a plethora of malware types, including ransomware and stealers like Phemedrone Stealer,\" the researchers said.</p>",
    "ref": "https://thehackernews.com/2024/01/hackers-weaponize-windows-flaw-to.html",
    "titleTh": "แฮกเกอร์ใช้อาวุธข้อบกพร่องของ Windows เพื่อปรับใช้ Phemedrone Stealer แบบ Crypto-Siphoning",
    "contentTh": "<p>พบว่าผู้คุกคามใช้ประโยชน์จากข้อบกพร่องด้านความปลอดภัยที่ได้รับการติดตั้งแล้วใน Microsoft Windows เพื่อปรับใช้ตัวขโมยข้อมูลโอเพ่นซอร์สที่เรียกว่า <strong>Phemedrone Stealer</strong></p><p> &quot;Phemedrone กำหนดเป้าหมายเว็บเบราว์เซอร์และข้อมูลจากกระเป๋าเงินดิจิทัลและแอปส่งข้อความ เช่น Telegram, Steam และ Discord&quot; นักวิจัยของ Trend Micro Peter Girnus, Aliakbar Zahravi และ Simon Zuckerbraun</p><p> “มันยังจับภาพหน้าจอและรวบรวมข้อมูลระบบเกี่ยวกับฮาร์ดแวร์ ตำแหน่ง และรายละเอียดระบบปฏิบัติการ ข้อมูลที่ถูกขโมยจะถูกส่งไปยังผู้โจมตีผ่านทาง Telegram หรือเซิร์ฟเวอร์คำสั่งและการควบคุม (C&amp;C)”</p><p> การใช้ประโยชน์จากการโจมตี (คะแนน CVSS: 8.8) ซึ่งเป็นช่องโหว่ด้านความปลอดภัยในการเลี่ยงผ่านใน Windows SmartScreen ที่สามารถใช้ประโยชน์ได้โดยการหลอกให้ผู้ใช้คลิกบนทางลัดอินเทอร์เน็ต (.URL) ที่สร้างขึ้นเป็นพิเศษ หรือไฮเปอร์ลิงก์ที่ชี้ไปยังไฟล์ทางลัดอินเทอร์เน็ต</p><p> ข้อบกพร่องที่ถูกใช้ประโยชน์อย่างแข็งขันเกิดขึ้นจาก Microsoft โดยเป็นส่วนหนึ่งของการอัปเดต Patch Tuesday เดือนพฤศจิกายน 2023</p><p> กระบวนการติดไวรัสเกี่ยวข้องกับผู้คุกคามที่โฮสต์ไฟล์ทางลัดอินเทอร์เน็ตที่เป็นอันตรายบน Discord หรือบริการคลาวด์ เช่น FileTransfer.io โดยลิงก์ยังถูกปกปิดโดยใช้ตัวย่อ URL เช่น .</p><p> การดำเนินการของไฟล์ .URL ที่ติดกับดักทำให้สามารถเชื่อมต่อกับเซิร์ฟเวอร์ที่ควบคุมโดยนักแสดงและดำเนินการไฟล์แผงควบคุม (.CPL) ในลักษณะที่หลีกเลี่ยง Windows Defender SmartScreen โดยการใช้ประโยชน์จาก CVE-2023-36025</p><p> “เมื่อไฟล์ .CPL ที่เป็นอันตรายถูกเรียกใช้งานผ่านไบนารีกระบวนการของ Windows Control Panel ไฟล์นั้นจะเรียก rundll32.exe เพื่อรัน DLL” นักวิจัยกล่าว “DLL ที่เป็นอันตรายนี้ทำหน้าที่เป็นตัวโหลดซึ่งจะเรียกใช้ Windows PowerShell เพื่อดาวน์โหลดและดำเนินการโจมตีขั้นต่อไปซึ่งโฮสต์บน GitHub”</p><p> เพย์โหลดที่ตามมาคือตัวโหลด PowerShell (&quot;DATA3.txt&quot;) ที่ทำหน้าที่เป็นแผ่นเปิดใช้สำหรับ ตัวโหลดเชลล์โค้ดแบบโอเพ่นซอร์สที่ถอดรหัสและดำเนินการ Phemedrone Stealer</p><p> Phemedrone Stealer เขียนด้วยภาษา C# ได้รับการดูแลอย่างแข็งขันโดยนักพัฒนาบน และ อำนวยความสะดวกในการขโมยข้อมูลที่ละเอียดอ่อนจากระบบที่ถูกบุกรุก</p><p> การพัฒนาดังกล่าวเป็นสัญญาณอีกครั้งหนึ่งว่าผู้คุกคามเริ่มมีความยืดหยุ่นมากขึ้น และปรับเปลี่ยนห่วงโซ่การโจมตีอย่างรวดเร็วเพื่อใช้ประโยชน์จากช่องโหว่ที่เพิ่งเปิดเผยและสร้างความเสียหายสูงสุด</p><p> “แม้จะได้รับการแก้ไขแล้ว แต่ผู้คุกคามยังคงค้นหาวิธีใช้ประโยชน์จาก CVE-2023-36025 และหลบเลี่ยงการป้องกัน Windows Defender SmartScreen เพื่อแพร่เชื้อผู้ใช้ด้วยมัลแวร์หลายประเภท รวมถึงแรนซัมแวร์และผู้ขโมยเช่น Phemedrone Stealer” นักวิจัยกล่าว</p>"
  },
  {
    "id": "_or626r0d9",
    "category": "Home",
    "title": "Zero-Day Alert: Update Chrome Now to Fix New Actively Exploited Vulnerability",
    "date": "2024-01-17T07:50:00+05:30",
    "author": "Newsroom",
    "pTags": "Browser Security / Vulnerability",
    "imgLinks": [
      "_ntkkyon4e"
    ],
    "contentEn": "<p>Google on Tuesday released updates to fix four security issues in its Chrome browser, including an actively exploited zero-day flaw.</p><p>The issue, tracked as , concerns an out-of-bounds memory access in the V8 JavaScript and WebAssembly engine, which can be weaponized by threat actors to trigger a crash.</p><p>\"By reading out-of-bounds memory, an attacker might be able to get secret values, such as memory addresses, which can be bypass protection mechanisms such as ASLR in order to improve the reliability and likelihood of exploiting a separate weakness to achieve code execution instead of just denial of service,\" according to MITRE's Common Weakness Enumeration ().</p><p>Additional details about the nature of the attacks and the threat actors that may be exploiting them have withheld in an attempt to prevent further exploitation. The issue was reported anonymously on January 11, 2024.</p><p>\"Out-of-bounds memory access in V8 in Google Chrome prior to 120.0.6099.224 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page,\" reads a  on the NIST's National Vulnerability Database (NVD).</p><p>The development marks the first actively exploited zero-day to be patched by Google in Chrome in 2024. Last year, the tech giant resolved a total of  in the browser.</p><p>Users are recommended to upgrade to Chrome version 120.0.6099.224/225 for Windows, 120.0.6099.234 for macOS, and 120.0.6099.224 for Linux to mitigate potential threats.</p><p>Users of Chromium-based browsers such as Microsoft Edge, Brave, Opera, and Vivaldi are also advised to apply the fixes as and when they become available.</p>",
    "ref": "https://thehackernews.com/2024/01/zero-day-alert-update-chrome-now-to-fix.html",
    "titleTh": "การแจ้งเตือนแบบ Zero-Day: อัปเดต Chrome ทันทีเพื่อแก้ไขช่องโหว่ใหม่ที่ถูกใช้ประโยชน์อย่างแข็งขัน",
    "contentTh": "<p>เมื่อวันอังคาร Google ได้เปิดตัวการอัปเดตเพื่อแก้ไขปัญหาด้านความปลอดภัยสี่ประการในเบราว์เซอร์ Chrome รวมถึงข้อบกพร่องแบบซีโรเดย์ที่ถูกเอาเปรียบอย่างแข็งขัน</p><p> ปัญหาที่ถูกติดตามในชื่อ เกี่ยวข้องกับการเข้าถึงหน่วยความจำนอกขอบเขตในกลไก V8 JavaScript และ WebAssembly ซึ่งสามารถติดอาวุธโดยผู้คุกคามเพื่อกระตุ้นให้เกิดการขัดข้อง</p><p> “ด้วยการอ่านหน่วยความจำนอกขอบเขต ผู้โจมตีอาจสามารถรับค่าที่เป็นความลับ เช่น ที่อยู่หน่วยความจำ ซึ่งสามารถเป็นกลไกการป้องกันแบบบายพาส เช่น ASLR เพื่อปรับปรุงความน่าเชื่อถือและโอกาสในการใช้ประโยชน์จากจุดอ่อนที่แยกจากกันเพื่อให้ได้รหัส การดำเนินการแทนการปฏิเสธการให้บริการเพียงอย่างเดียว&quot; ตามการแจงนับจุดอ่อนทั่วไปของ MITRE ()</p><p> รายละเอียดเพิ่มเติมเกี่ยวกับลักษณะของการโจมตีและผู้กระทำภัยคุกคามที่อาจแสวงหาผลประโยชน์จากพวกเขาได้ระงับไว้เพื่อพยายามป้องกันการแสวงหาประโยชน์เพิ่มเติม มีการรายงานปัญหานี้โดยไม่เปิดเผยตัวตนเมื่อวันที่ 11 มกราคม 2024</p><p> “การเข้าถึงหน่วยความจำนอกขอบเขตใน V8 ใน Google Chrome ก่อน 120.0.6099.224 อนุญาตให้ผู้โจมตีระยะไกลใช้ประโยชน์จากความเสียหายของฮีปผ่านหน้า HTML ที่สร้างขึ้น” อ่านในฐานข้อมูลช่องโหว่แห่งชาติ (NVD) ของ NIST</p><p> การพัฒนานี้ถือเป็นการดำเนินการแบบ Zero-day ครั้งแรกที่ Google ได้รับแพตช์ใน Chrome ในปี 2024 เมื่อปีที่แล้ว ยักษ์ใหญ่ด้านเทคโนโลยีได้แก้ไขปัญหาทั้งหมดในเบราว์เซอร์</p><p> ขอแนะนำให้ผู้ใช้อัปเกรดเป็น Chrome เวอร์ชัน 120.0.6099.224/225 สำหรับ Windows, 120.0.6099.234 สำหรับ macOS และ 120.0.6099.224 สำหรับ Linux เพื่อบรรเทาภัยคุกคามที่อาจเกิดขึ้น</p><p> ผู้ใช้เบราว์เซอร์ที่ใช้ Chromium เช่น Microsoft Edge, Brave, Opera และ Vivaldi ควรใช้การแก้ไขเมื่อและเมื่อพร้อมใช้งาน</p>"
  },
  {
    "id": "_kkskjtdni",
    "category": "Home",
    "title": "Citrix, VMware, and Atlassian Hit with Critical Flaws — Patch ASAP!",
    "date": "2024-01-17T09:44:00+05:30",
    "author": "Newsroom",
    "pTags": "Vulnerability / Cyber Threat",
    "imgLinks": [
      "_tbpf1qg0z"
    ],
    "contentEn": "<p>Citrix is  of two zero-day security vulnerabilities in NetScaler ADC (formerly Citrix ADC) and NetScaler Gateway (formerly Citrix Gateway) that are being actively exploited in the wild.</p><p>The flaws are listed below -</p><p>The following customer-managed versions of NetScaler ADC and NetScaler Gateway are impacted by the shortcomings -</p><p>\"Exploits of these CVEs on unmitigated appliances have been observed,\" Citrix said, without sharing any additional specifics. Users of NetScaler ADC and NetScaler Gateway version 12.1 are recommended to upgrade their appliances to a supported version that patches the flaws.</p><p>It's also advised to not expose the management interface to the internet to reduce the risk of exploitation.</p><p>In recent months, multiple security vulnerabilities in Citrix appliances ( and ) have been weaponized by threat actors to drop web shells and hijack existing authenticated sessions.</p><p>The disclosure comes as VMware  customers of a critical security vulnerability in Aria Automation (previously vRealize Automation) that could allow an authenticated attacker to gain unauthorized access to remote organizations and workflows.</p><p>The issue has been assigned the CVE identifier  (CVSS score: 9.9), with the Broadcom-owned virtualization services provider describing it as a \"missing access control\" flaw.</p><p>Commonwealth Scientific and Industrial Research Organization's (CSIRO) Scientific Computing Platforms team has been credited with discovering and reporting the security vulnerability.</p><p>The versions impacted by the vulnerability are provided below -</p><p>VMware Cloud Foundation ()</p><p>\"The only supported upgrade path after applying the patch is to version 8.16,\" VMware . \"If you upgrade to an intermediate version, the vulnerability will be reintroduced, requiring an additional round of patching.\"</p><p>The development also follows Atlassian's release of patches for over , including a critical remote code execution (RCE) flaw impacting Confluence Data Center and Confluence Server.</p><p>The vulnerability, <strong>CVE-2023-22527</strong>, has been assigned a CVSS score of 10.0, indicating maximum severity. It affects versions 8.0.x, 8.1.x, 8.2.x, 8.3.x, 8.4.x, and 8.5.0-8.5.3. It's worth noting that 7.19.x LTS versions are not affected by the vulnerability.</p><p>\"A template injection vulnerability on out-of-date versions of Confluence Data Center and Server allows an unauthenticated attacker to achieve RCE on an affected version,\" the Australian company .</p><p><br>The issue has been  in versions 8.5.4, 8.5.5 (Confluence Data Center and Server), 8.6.0, 8.7.1, and 8.7.2 (Data Center only). Users who are on out-of-date instances are recommended to update their installations to the latest version available.</p>",
    "ref": "https://thehackernews.com/2024/01/citrix-vmware-and-atlassian-hit-with.html",
    "titleTh": "Citrix, VMware และ Atlassian พบกับข้อบกพร่องที่สำคัญ — แพทช์โดยเร็วที่สุด!",
    "contentTh": "<p>Citrix มีช่องโหว่ด้านความปลอดภัยแบบ Zero-day สองรายการใน NetScaler ADC (เดิมคือ Citrix ADC) และ NetScaler Gateway (เดิมคือ Citrix Gateway) ที่กำลังถูกโจมตีอย่างแข็งขันในป่า</p><p> ข้อบกพร่องมีการระบุไว้ด้านล่าง -</p><p> NetScaler ADC และ NetScaler Gateway เวอร์ชันที่จัดการโดยลูกค้าต่อไปนี้ได้รับผลกระทบจากข้อบกพร่อง -</p><p> “มีการพบเห็นการใช้ประโยชน์จาก CVE เหล่านี้กับอุปกรณ์ที่ไม่มีการบรรเทาผลกระทบ” Citrix กล่าว โดยไม่เปิดเผยข้อมูลเฉพาะเจาะจงเพิ่มเติมใดๆ ขอแนะนำให้ผู้ใช้ NetScaler ADC และ NetScaler Gateway เวอร์ชัน 12.1 อัปเกรดอุปกรณ์เป็นเวอร์ชันที่รองรับซึ่งจะแก้ไขข้อบกพร่อง</p><p> ขอแนะนำอย่าเปิดเผยอินเทอร์เฟซการจัดการกับอินเทอร์เน็ตเพื่อลดความเสี่ยงในการถูกเอารัดเอาเปรียบ</p><p> ในช่วงหลายเดือนที่ผ่านมา ช่องโหว่ด้านความปลอดภัยหลายประการในอุปกรณ์ Citrix ( และ ) ได้รับการติดอาวุธโดยผู้คุกคามเพื่อทิ้ง Web Shell และจี้เซสชันการรับรองความถูกต้องที่มีอยู่</p><p> การเปิดเผยดังกล่าวเกิดขึ้นในขณะที่ลูกค้า VMware มีช่องโหว่ด้านความปลอดภัยที่สำคัญใน Aria Automation (ก่อนหน้านี้เรียกว่า vRealize Automation) ซึ่งอาจทำให้ผู้โจมตีที่ได้รับการตรวจสอบสิทธิ์เข้าถึงองค์กรและเวิร์กโฟลว์ระยะไกลโดยไม่ได้รับอนุญาต</p><p> ปัญหานี้ได้รับการกำหนดตัวระบุ CVE (คะแนน CVSS: 9.9) โดยผู้ให้บริการระบบเสมือนที่ Broadcom เป็นเจ้าของอธิบายว่าเป็นข้อบกพร่อง &quot;การควบคุมการเข้าถึงที่ขาดหายไป&quot;</p><p> ทีมแพลตฟอร์มคอมพิวเตอร์ทางวิทยาศาสตร์ขององค์กรวิจัยวิทยาศาสตร์และอุตสาหกรรมแห่งเครือจักรภพ (CSIRO) ได้รับเครดิตในการค้นพบและรายงานช่องโหว่ด้านความปลอดภัย</p><p> เวอร์ชันที่ได้รับผลกระทบจากช่องโหว่มีดังต่อไปนี้ -</p><p> มูลนิธิ VMware Cloud ()</p><p> &quot;เส้นทางการอัพเกรดเดียวที่รองรับหลังจากใช้แพตช์คือเวอร์ชัน 8.16&quot; VMware “หากคุณอัปเกรดเป็นเวอร์ชันกลาง ช่องโหว่ดังกล่าวจะถูกนำกลับมาใช้ใหม่ โดยต้องมีการแพตช์เพิ่มเติม”</p><p> การพัฒนายังเป็นไปตามการเปิดตัวแพทช์ของ Atlassian สำหรับมากกว่า ซึ่งรวมถึงข้อบกพร่องการเรียกใช้โค้ดระยะไกลที่สำคัญ (RCE) ที่ส่งผลกระทบต่อ Confluence Data Center และ Confluence Server</p><p> ช่องโหว่ <strong>CVE-2023-22527</strong> ได้รับการกำหนดคะแนน CVSS ไว้ที่ 10.0 ซึ่งแสดงถึงระดับความรุนแรงสูงสุด มีผลกับเวอร์ชัน 8.0.x, 8.1.x, 8.2.x, 8.3.x, 8.4.x และ 8.5.0-8.5.3 เป็นที่น่าสังเกตว่าเวอร์ชัน 7.19.x LTS ไม่ได้รับผลกระทบจากช่องโหว่นี้</p><p> “ช่องโหว่การแทรกเทมเพลตใน Confluence Data Center และ Server เวอร์ชันล้าสมัยทำให้ผู้โจมตีที่ไม่ได้รับการรับรองความถูกต้องสามารถเข้าถึง RCE ในเวอร์ชันที่ได้รับผลกระทบ” บริษัทในออสเตรเลีย</p><p><br> ปัญหานี้เกิดขึ้นในเวอร์ชัน 8.5.4, 8.5.5 (Confluence Data Center and Server), 8.6.0, 8.7.1 และ 8.7.2 (Data Center เท่านั้น) ขอแนะนำให้ผู้ใช้ที่ใช้อินสแตนซ์ที่ล้าสมัยอัปเดตการติดตั้งเป็นเวอร์ชันล่าสุดที่มี</p>"
  },
  {
    "id": "_2amszlg8s",
    "category": "Home",
    "title": "New iShutdown Method Exposes Hidden Spyware Like Pegasus on Your iPhone",
    "date": "2024-01-17T15:52:00+05:30",
    "author": "Newsroom",
    "pTags": "Spyware / Forensic Analysis",
    "imgLinks": [
      "_ocg3kn9xt"
    ],
<<<<<<< HEAD
    "contentEn": "\nThreat actors are resorting to YouTube videos featuring content related to cracked software in order to entice users into downloading an information stealer malware called Lumma.\n\"These YouTube videos typically feature content related to cracked applications, presenting users with similar installation guides and incorporating malicious URLs often shortened using services like TinyURL and Cuttly,\" Fortinet FortiGuard Labs researcher Cara Lin said in a Monday analysis.\nThis is not the first time pirated software videos on YouTube have emerged as an effective bait for stealer malware. Previously similar attack chains were observed delivering stealers, clippers, and crypto miner malware.\n\nIn doing so, threat actors can leverage the compromised machines for not only information and cryptocurrency theft, but also abuse the resources for illicit mining.\nIn the latest attack sequence documented by Fortinet, users searching for cracked versions of legitimate video editing tools like Vegas Pro on YouTube are prompted to click on a link located in the video's description, leading to the download of a bogus installer hosted on MediaFire.\n\nThe ZIP installer, once unpacked, features a Windows shortcut (LNK) masquerading as a setup file that downloads a .NET loader from a GitHub repository, which, in turn, loads the stealer payload, but not before performing a series of anti-virtual machine and anti-debugging checks.\nLumma Stealer, written in C and offered for sale on underground forums since late 2022, is capable of harvesting and exfiltrating sensitive data to an actor-controlled server.\nThe development comes as Bitdefender warned of stream-jacking attacks on YouTube in which cybercriminals take over high-profile accounts via phishing attacks that deploy the RedLine Stealer malware to siphon their credentials and session cookies, and ultimately promote various crypto scams.\n\nIt also follows the discovery of an 11-month-old AsyncRAT campaign that employs phishing lures to download an obfuscated JavaScript file that's then utilized to drop the remote access trojan.\n\"The victims and their companies are carefully selected to broaden the impact of the campaign,\" AT&T Alien Labs researcher Fernando Martinez said. \"Some of the identified targets manage key infrastructure in the U.S.\"\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/beware-youtube-videos-promoting-cracked.html",
    "titleTh": "ระวัง! วิดีโอ YouTube ที่โปรโมตซอฟต์แวร์แคร็กแจกจ่าย Lumma Stealer",
    "contentTh": "ผู้คุกคามหันไปดูวิดีโอ YouTube ที่มีเนื้อหาเกี่ยวกับซอฟต์แวร์ถอดรหัสเพื่อดึงดูดผู้ใช้ให้ดาวน์โหลดมัลแวร์ขโมยข้อมูลที่เรียกว่า Lumma “วิดีโอ YouTube เหล่านี้มักมีเนื้อหาที่เกี่ยวข้องกับแอพพลิเคชั่นที่ถอดรหัส โดยนำเสนอผู้ใช้ด้วยคำแนะนำในการติดตั้งที่คล้ายกัน และรวม URL ที่เป็นอันตรายซึ่งมักจะถูกทำให้สั้นลงเมื่อใช้บริการเช่น TinyURL และ Cuttly” Cara Lin นักวิจัยของ Fortinet FortiGuard Labs กล่าวในการวิเคราะห์เมื่อวันจันทร์ นี่ไม่ใช่ครั้งแรกที่วิดีโอซอฟต์แวร์ละเมิดลิขสิทธิ์บน YouTube กลายเป็นเหยื่อล่อมัลแวร์ที่มีประสิทธิภาพ ก่อนหน้านี้พบว่ามีการโจมตีแบบลูกโซ่ที่ส่งผู้ขโมย คลิปเปอร์ และมัลแวร์ตัวขุดคริปโต ในการทำเช่นนั้น ผู้คุกคามสามารถใช้ประโยชน์จากเครื่องที่ถูกบุกรุกไม่เพียงแต่ข้อมูลและการขโมยสกุลเงินดิจิทัลเท่านั้น แต่ยังใช้ทรัพยากรในทางที่ผิดสำหรับการขุดที่ผิดกฎหมายอีกด้วย ในลำดับการโจมตีล่าสุดที่จัดทำโดย Fortinet ผู้ใช้ที่ค้นหาเครื่องมือตัดต่อวิดีโอที่ถูกต้องตามกฎหมายเช่น Vegas Pro บน YouTube จะได้รับแจ้งให้คลิกลิงก์ที่อยู่ในคำอธิบายของวิดีโอ ซึ่งจะนำไปสู่การดาวน์โหลดตัวติดตั้งปลอมที่โฮสต์บน MediaFire เมื่อคลายแพ็กตัวติดตั้ง ZIP แล้ว จะมีทางลัด Windows (LNK) ปลอมตัวเป็นไฟล์ติดตั้งที่ดาวน์โหลดไฟล์ .NET จากที่เก็บ GitHub ซึ่งในทางกลับกันจะโหลดเพย์โหลดของผู้ขโมย แต่ไม่ใช่ก่อนที่จะดำเนินการชุดต่อต้านเสมือน การตรวจสอบเครื่องจักรและการป้องกันการดีบัก Lumma Stealer ซึ่งเขียนด้วยภาษา C และเสนอขายในฟอรัมใต้ดินตั้งแต่ปลายปี 2022 สามารถเก็บเกี่ยวและกรองข้อมูลที่ละเอียดอ่อนไปยังเซิร์ฟเวอร์ที่ควบคุมโดยนักแสดง การพัฒนาดังกล่าวเกิดขึ้นเมื่อ Bitdefender เตือนถึงการโจมตีแบบสตรีมแจ็คบน YouTube ซึ่งอาชญากรไซเบอร์เข้าครอบครองบัญชีที่มีโปรไฟล์สูงผ่านการโจมตีแบบฟิชชิ่งที่ใช้มัลแวร์ RedLine Stealer เพื่อดูดข้อมูลประจำตัวและคุกกี้เซสชันของพวกเขา และท้ายที่สุดก็ส่งเสริมการหลอกลวง crypto ต่างๆ นอกจากนี้ยังติดตามการค้นพบแคมเปญ AsyncRAT อายุ 11 เดือนที่ใช้เหยื่อฟิชชิ่งเพื่อดาวน์โหลดไฟล์ JavaScript ที่สร้างความสับสน จากนั้นจะถูกใช้ในการปล่อยโทรจันการเข้าถึงระยะไกล “เหยื่อและบริษัทของพวกเขาได้รับการคัดเลือกอย่างรอบคอบเพื่อขยายผลกระทบของการรณรงค์” เฟอร์นันโด มาร์ติเนซ นักวิจัยของ AT&amp;T Alien Labs กล่าว &quot;เป้าหมายที่ระบุบางส่วนจัดการโครงสร้างพื้นฐานที่สำคัญในสหรัฐอเมริกา&quot;"
  },
  {
    "id": "_0rjxtrs2l",
    "category": "Home",
    "title": "Alert: New Vulnerabilities Discovered in QNAP and Kyocera Device Manager",
    "date": "Jan 09, 2024",
    "author": "Newsroom",
    "pTags": "Network Security / Data Protection",
    "imgLinks": [
      "qnap.jpg"
    ],
    "contentEn": "\nA security flaw has been disclosed in Kyocera's Device Manager product that could be exploited by bad actors to carry out malicious activities on affected systems.\n\"This vulnerability allows attackers to coerce authentication attempts to their own resources, such as a malicious SMB share, to capture or relay Active Directory hashed credentials if the 'Restrict NTLM: Outgoing NTLM traffic to remote servers' security policy is not enabled,\" Trustwave said.\nTracked as CVE-2023-50916, Kyocera, in an advisory released late last month, described it as a path traversal issue that enables an attacker to intercept and alter a local path pointing to the backup location of the database to a universal naming convention (UNC) path.\n\nThis, in turn, causes the web application to attempt to authenticate the rogue UNC path, resulting in unauthorized access to clients' accounts and data theft. Furthermore, depending on the configuration of the environment, it could be exploited to pull off NTLM relay attacks.\nThe shortcoming has been addressed in Kyocera Device Manager version 3.1.1213.0.\nQNAP Releases Fixes for Several Flaws#\nThe development comes as QNAP released fixes for several flaws, including high-severity vulnerabilities impacting QTS and QuTS hero, QuMagie, Netatalk and Video Station.\nThis comprises CVE-2023-39296, a prototype pollution vulnerability that could allow remote attackers to \"override existing attributes with ones that have an incompatible type, which may cause the system to crash.\"\nThe shortcoming has been addressed in versions QTS 5.1.3.2578 build 20231110 and QuTS hero h5.1.3.2578 build 20231110.\n\nA brief description of the other notable flaws is as follows -\n\nCVE-2023-47559 - A cross-site scripting (XSS) vulnerability in QuMagie that could allow authenticated users to inject malicious code via a network (Addressed in QuMagie 2.2.1 and later)\nCVE-2023-47560 - An operating system command injection vulnerability in QuMagie that could allow authenticated users to execute commands via a network (Addressed in QuMagie 2.2.1 and later)\nCVE-2023-41287 - An SQL injection vulnerability in Video Station that could allow users to inject malicious code via a network (Addressed in Video Station 5.7.2 and later)\nCVE-2023-41288 - An operating system command injection vulnerability in Video Station that could allow users to execute commands via a network (Addressed in Video Station 5.7.2 and later)\nCVE-2022-43634 - An unauthenticated remote code execution vulnerability in Netatalk that could allow attackers to execute arbitrary code (Addressed in QTS 5.1.3.2578 build 20231110 and QuTS hero h5.1.3.2578 build 20231110)\n\nWhile there is no evidence that the flaws have been exploited in the wild, it's recommended that users take steps to update their installations to the latest version to mitigate potential risks.\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/alert-new-vulnerabilities-discovered-in.html",
    "titleTh": "การแจ้งเตือน: พบช่องโหว่ใหม่ใน QNAP และ Kyocera Device Manager",
    "contentTh": "มีการเปิดเผยข้อบกพร่องด้านความปลอดภัยในผลิตภัณฑ์ Device Manager ของ Kyocera ซึ่งอาจถูกใช้โดยผู้ไม่ประสงค์ดีเพื่อดำเนินกิจกรรมที่เป็นอันตรายบนระบบที่ได้รับผลกระทบ “ช่องโหว่นี้ทำให้ผู้โจมตีสามารถบังคับความพยายามในการตรวจสอบสิทธิ์ทรัพยากรของตนเอง เช่น การแชร์ SMB ที่เป็นอันตราย เพื่อจับภาพหรือถ่ายทอดข้อมูลประจำตัวที่แฮชของ Active Directory หากไม่ได้เปิดใช้งานนโยบายความปลอดภัย &#39;จำกัด NTLM: การรับส่งข้อมูล NTLM ขาออกไปยังเซิร์ฟเวอร์ระยะไกล&#39; Trustwave พูดว่า. ติดตามในชื่อ CVE-2023-50916 Kyocera ในคำแนะนำที่เผยแพร่เมื่อปลายเดือนที่แล้ว อธิบายว่าเป็นปัญหาการข้ามเส้นทางที่ช่วยให้ผู้โจมตีสามารถสกัดกั้นและเปลี่ยนแปลงเส้นทางในเครื่องที่ชี้ไปยังตำแหน่งสำรองของฐานข้อมูลตามแบบแผนการตั้งชื่อสากล ( UNC) เส้นทาง ซึ่งในทางกลับกัน จะทำให้แอปพลิเคชันเว็บพยายามตรวจสอบเส้นทาง UNC อันธพาล ส่งผลให้เกิดการเข้าถึงบัญชีของลูกค้าและการโจรกรรมข้อมูลโดยไม่ได้รับอนุญาต นอกจากนี้ ขึ้นอยู่กับการกำหนดค่าของสภาพแวดล้อม อาจถูกนำไปใช้เพื่อดึงการโจมตีรีเลย์ NTLM ข้อบกพร่องได้รับการแก้ไขแล้วใน Kyocera Device Manager เวอร์ชัน 3.1.1213.0 QNAP เผยแพร่การแก้ไขข้อบกพร่องหลายประการ # การพัฒนาดังกล่าวเกิดขึ้นเมื่อ QNAP เปิดตัวการแก้ไขข้อบกพร่องหลายประการ รวมถึงช่องโหว่ที่มีความรุนแรงสูงซึ่งส่งผลกระทบต่อฮีโร่ QTS และ QuTS, QuMagie, Netatalk และ Video Station ซึ่งประกอบด้วย CVE-2023-39296 ซึ่งเป็นช่องโหว่ต้นแบบที่อาจทำให้ผู้โจมตีระยะไกลสามารถ &quot;แทนที่คุณลักษณะที่มีอยู่ด้วยประเภทที่เข้ากันไม่ได้ ซึ่งอาจทำให้ระบบล่ม&quot; ข้อบกพร่องได้รับการแก้ไขแล้วในเวอร์ชัน QTS 5.1.3.2578 build 20231110 และ QuTS hero h5.1.3.2578 build 20231110 คำอธิบายโดยย่อของข้อบกพร่องที่น่าสังเกตอื่น ๆ มีดังนี้ - CVE-2023-47559 - ช่องโหว่ cross-site scripting (XSS) ใน QuMagie ที่อาจอนุญาตให้ผู้ใช้ที่ได้รับการรับรองความถูกต้องฉีดโค้ดที่เป็นอันตรายผ่านเครือข่าย (ระบุอยู่ใน QuMagie 2.2.1 และใหม่กว่า) CVE-2023-47560 - ช่องโหว่การแทรกคำสั่งของระบบปฏิบัติการใน QuMagie ที่อาจอนุญาตให้ผู้ใช้ที่ได้รับการรับรองความถูกต้องสามารถรันคำสั่งผ่านเครือข่าย (แก้ไขใน QuMagie 2.2.1 และใหม่กว่า) CVE-2023-41287 - ช่องโหว่การแทรก SQL ใน Video Station ที่อาจทำให้ผู้ใช้สามารถแทรกโค้ดที่เป็นอันตรายผ่านเครือข่าย (ระบุอยู่ใน Video Station 5.7.2 และใหม่กว่า) CVE-2023-41288 - ช่องโหว่ command inject ของระบบปฏิบัติการใน Video Station ที่อาจอนุญาตให้ผู้ใช้สามารถรันคำสั่งผ่านเครือข่าย (ระบุอยู่ใน Video Station 5.7.2 และใหม่กว่า) CVE-2022-43634 - ช่องโหว่การเรียกใช้โค้ดจากระยะไกลที่ไม่ได้รับการรับรองความถูกต้องใน Netatalk ที่อาจทำให้ผู้โจมตีสามารถรันโค้ดได้โดยอำเภอใจ (แก้ไขใน QTS 5.1.3.2578 build 20231110 และ QuTS hero h5.1.3.2578 build 20231110) แม้ว่าจะไม่มีหลักฐานว่าข้อบกพร่องดังกล่าวถูกนำไปใช้ประโยชน์อย่างแพร่หลาย แต่ขอแนะนำให้ผู้ใช้ดำเนินการอัปเดตการติดตั้งเป็นเวอร์ชันล่าสุดเพื่อลดความเสี่ยงที่อาจเกิดขึ้น"
=======
    "contentEn": "<p>Cybersecurity researchers have identified a \"lightweight method\" called <strong>iShutdown</strong> for reliably identifying signs of spyware on Apple iOS devices, including notorious threats like NSO Group's , QuaDream's , and Intellexa's .</p><p>Kaspersky, which analyzed a set of iPhones that were compromised with Pegasus, said the infections left traces in a file named \"Shutdown.log,\" a text-based system log file available on all iOS devices and which records every reboot event alongside its environment characteristics.</p><p>\"Compared to more time-consuming acquisition methods like forensic device imaging or a full iOS backup, retrieving the Shutdown.log file is rather straightforward,\" security researcher Maher Yamout . \"The log file is stored in a sysdiagnose (sysdiag) archive.\"</p><p>The Russian cybersecurity firm said it identified entries in the log file that recorded instances where \"sticky\" processes, such as those associated with the spyware, caused a reboot delay, in some cases observing Pegasus-related processes in over four reboot delay notices.</p><p>What's more, the investigation revealed a the presence of a similar filesystem path that's used by all the three spyware families – \"/private/var/db/\" for Pegasus and Reign, and \"/private/var/tmp/\" for Predator – thereby acting as an indicator of compromise.</p><p>That said, the success of this approach hinges on a caveat that the target user reboots their device as often as possible, the frequency for which varies according to their threat profile.</p><p>Kaspersky has also  a collection of Python scripts to extract, analyze, and parse the Shutdown.log in order to extract the reboot stats.</p><p>\"The lightweight nature of this method makes it readily available and accessible,\" Yamout said. \"Moreover, this log file can store entries for several years, making it a valuable forensic artifact for analyzing and identifying anomalous log entries.\"</p><p>The disclosure comes as SentinelOne revealed information stealers targeting macOS such as , , and  (aka CherryPie or Gary Stealer) are quickly adapting to circumvent Apple's built-in antivirus technology called .</p><p>\"Despite solid efforts by Apple to update its XProtect signature database, these rapidly evolving malware strains continue to evade,\" security researcher Phil Stokes . \"Relying solely on signature-based detection is insufficient as threat actors have the means and motive to adapt at speed.\"</p>",
    "ref": "https://thehackernews.com/2024/01/new-ishutdown-method-exposes-hidden.html",
    "titleTh": "วิธี iShutdown ใหม่เปิดเผยสปายแวร์ที่ซ่อนอยู่เช่น Pegasus บน iPhone ของคุณ",
    "contentTh": "<p>นักวิจัยด้านความปลอดภัยทางไซเบอร์ได้ระบุ &quot;วิธีการที่ไม่ซับซ้อน&quot; ที่เรียกว่า <strong>iShutdown</strong> เพื่อระบุสัญญาณของสปายแวร์บนอุปกรณ์ iOS ของ Apple ได้อย่างน่าเชื่อถือ รวมถึงภัยคุกคามฉาวโฉ่เช่น NSO Group&#39;s, QuaDream&#39;s และ Intellexa&#39;s</p><p> Kaspersky ซึ่งวิเคราะห์ชุด iPhone ที่ถูกบุกรุกโดย Pegasus กล่าวว่าการติดไวรัสทิ้งร่องรอยไว้ในไฟล์ชื่อ &quot;Shutdown.log&quot; ซึ่งเป็นไฟล์บันทึกระบบแบบข้อความที่มีอยู่ในอุปกรณ์ iOS ทั้งหมด และบันทึกทุกเหตุการณ์การรีบูตควบคู่ไปกับสภาพแวดล้อมของมัน ลักษณะเฉพาะ.</p><p> &quot;เมื่อเทียบกับวิธีการได้มาซึ่งใช้เวลานานกว่า เช่น การสร้างภาพอุปกรณ์ทางนิติเวชหรือการสำรองข้อมูล iOS เต็มรูปแบบ การดึงไฟล์ Shutdown.log ค่อนข้างตรงไปตรงมา&quot; นักวิจัยด้านความปลอดภัย Maher Yamout &quot;ไฟล์บันทึกถูกเก็บไว้ในไฟล์เก็บถาวร sysdiagnose (sysdiag)&quot;</p><p> บริษัทรักษาความปลอดภัยทางไซเบอร์ของรัสเซียกล่าวว่า ได้ระบุรายการในไฟล์บันทึกที่บันทึกกรณีที่กระบวนการ &quot;เหนียว&quot; เช่น กระบวนการที่เกี่ยวข้องกับสปายแวร์ ทำให้เกิดความล่าช้าในการรีบูต ในบางกรณีได้สังเกตกระบวนการที่เกี่ยวข้องกับ Pegasus ในการแจ้งเตือนการหน่วงเวลาการรีบูตมากกว่าสี่ครั้ง</p><p> ยิ่งไปกว่านั้น การสืบสวนพบว่ามีพาธของระบบไฟล์ที่คล้ายกันซึ่งใช้โดยสปายแวร์ทั้งสามตระกูล – &quot;/private/var/db/&quot; สำหรับ Pegasus และ Reign และ &quot;/private/var/tmp/&quot; สำหรับ Predator – จึงทำหน้าที่เป็นตัวบ่งชี้การประนีประนอม</p><p> อย่างไรก็ตาม ความสำเร็จของแนวทางนี้ขึ้นอยู่กับคำเตือนว่าผู้ใช้เป้าหมายจะรีบูทอุปกรณ์ของตนบ่อยที่สุดเท่าที่จะเป็นไปได้ โดยความถี่จะแตกต่างกันไปตามโปรไฟล์ภัยคุกคาม</p><p> Kaspersky ยังมีชุดสคริปต์ Python เพื่อแยก วิเคราะห์ และแยกวิเคราะห์ Shutdown.log เพื่อแยกสถิติการรีบูต</p><p> “ลักษณะที่ไม่ซับซ้อนของวิธีนี้ทำให้พร้อมใช้งานและเข้าถึงได้” Yamout กล่าว &quot;ยิ่งกว่านั้น ไฟล์บันทึกนี้สามารถจัดเก็บรายการต่างๆ ได้เป็นเวลาหลายปี ทำให้เป็นสิ่งประดิษฐ์ทางนิติวิทยาศาสตร์ที่มีคุณค่าสำหรับการวิเคราะห์และระบุรายการบันทึกที่ผิดปกติ&quot;</p><p> การเปิดเผยดังกล่าวเกิดขึ้นเมื่อ SentinelOne เปิดเผยผู้ขโมยข้อมูลที่กำหนดเป้าหมายไปที่ macOS เช่น , และ (aka CherryPie หรือ Gary Stealer) กำลังปรับตัวอย่างรวดเร็วเพื่อหลีกเลี่ยงเทคโนโลยีป้องกันไวรัสในตัวของ Apple ที่เรียกว่า</p><p> “แม้ว่า Apple จะพยายามอย่างแข็งขันในการอัปเดตฐานข้อมูลลายเซ็น XProtect แต่สายพันธุ์มัลแวร์ที่พัฒนาอย่างรวดเร็วเหล่านี้ยังคงหลบเลี่ยง” Phil Stokes นักวิจัยด้านความปลอดภัย “การใช้การตรวจจับตามลายเซ็นเพียงอย่างเดียวนั้นไม่เพียงพอ เนื่องจากผู้คุกคามมีหนทางและแรงจูงใจในการปรับตัวอย่างรวดเร็ว”</p>"
  },
  {
    "id": "_rilyeg0gq",
    "category": "Home",
    "title": "GitHub Rotates Keys After High-Severity Vulnerability Exposes Credentials",
    "date": "2024-01-17T13:11:00+05:30",
    "author": "Newsroom",
    "pTags": "Vulnerability / Software Security",
    "imgLinks": [
      "_6fg2tpgqd"
    ],
    "contentEn": "<p>GitHub has revealed that it has rotated some keys in response to a security vulnerability that could be potentially exploited to gain access to credentials within a production container.</p><p>The Microsoft-owned subsidiary said it was made aware of the problem on December 26, 2023, and that it addressed the issue the same day, in addition to rotating all potentially exposed credentials out of an abundance of caution.</p><p>The rotated keys include the GitHub commit signing key as well as GitHub Actions, GitHub Codespaces, and Dependabot customer encryption keys, necessitating users who rely on these keys to import the new ones.</p><p>There is no evidence that the high-severity vulnerability tracked as  (CVSS score: 7.2), has been previously found and exploited in the wild.</p><p>\"This vulnerability is also present on GitHub Enterprise Server (GHES),\" GitHub's Jacob DePriest . \"However, exploitation requires an authenticated user with an  to be logged into an account on the GHES instance, which is a significant set of mitigating circumstances to potential exploitation.\"</p><p>In a , GitHub characterized the vulnerability as a case of \"unsafe reflection\" GHES that could lead to reflection injection and remote code execution. It has been patched in GHES versions 3.8.13, 3.9.8, 3.10.5, and 3.11.3.</p><p>Also addressed by GitHub is another high-severity bug tracked as  (CVSS score: 6.5), which could permit an attacker with access to a Management Console user account with the editor role to escalate privileges via command injection.</p><p>The development comes nearly a year after the company took the step of  used to secure Git operations \"out of an abundance of caution\" after it was briefly exposed in a public repository.</p>",
    "ref": "https://thehackernews.com/2024/01/github-rotates-keys-after-high-severity.html",
    "titleTh": "GitHub หมุนเวียนคีย์หลังจากช่องโหว่ที่มีความรุนแรงสูงเปิดเผยข้อมูลประจำตัว",
    "contentTh": "<p>GitHub ได้เปิดเผยว่าได้หมุนเวียนคีย์บางตัวเพื่อตอบสนองต่อช่องโหว่ด้านความปลอดภัยที่อาจถูกนำไปใช้เพื่อเข้าถึงข้อมูลประจำตัวภายในคอนเทนเนอร์ที่ใช้งานจริง</p><p> บริษัทในเครือของ Microsoft กล่าวว่าได้รับทราบปัญหาแล้วเมื่อวันที่ 26 ธันวาคม 2023 และได้แก้ไขปัญหาดังกล่าวในวันเดียวกัน นอกเหนือจากการหมุนเวียนข้อมูลรับรองที่อาจเปิดเผยทั้งหมดโดยใช้ความระมัดระวังอย่างยิ่ง</p><p> คีย์ที่หมุนเวียน ได้แก่ คีย์การเซ็นชื่อ GitHub เช่นเดียวกับ GitHub Actions, GitHub Codespaces และคีย์การเข้ารหัสลูกค้า Dependabot ซึ่งจำเป็นต้องมีผู้ใช้ที่ต้องอาศัยคีย์เหล่านี้เพื่อนำเข้าคีย์ใหม่</p><p> ไม่มีหลักฐานว่าช่องโหว่ที่มีความรุนแรงสูงที่ถูกติดตามด้วย (คะแนน CVSS: 7.2) ได้ถูกค้นพบและนำไปใช้ประโยชน์ในป่าก่อนหน้านี้</p><p> “ช่องโหว่นี้ยังปรากฏอยู่ใน GitHub Enterprise Server (GHES)” Jacob DePriest จาก GitHub “อย่างไรก็ตาม การแสวงหาประโยชน์จำเป็นต้องมีผู้ใช้ที่ผ่านการรับรองความถูกต้องและต้องลงชื่อเข้าใช้บัญชีบนอินสแตนซ์ GHES ซึ่งเป็นชุดสำคัญในการบรรเทาสถานการณ์ที่นำไปสู่การแสวงหาประโยชน์ที่อาจเกิดขึ้น”</p><p> ใน GitHub ระบุลักษณะช่องโหว่ว่าเป็นกรณีของ GHES &quot;การสะท้อนที่ไม่ปลอดภัย&quot; ซึ่งอาจนำไปสู่การแทรกการสะท้อนและการเรียกใช้โค้ดจากระยะไกล ได้รับการแก้ไขแล้วใน GHES เวอร์ชัน 3.8.13, 3.9.8, 3.10.5 และ 3.11.3</p><p> นอกจากนี้ GitHub ยังแก้ไขจุดบกพร่องที่มีความรุนแรงสูงอีกจุดหนึ่งที่ถูกติดตามด้วย (คะแนน CVSS: 6.5) ซึ่งอาจอนุญาตให้ผู้โจมตีที่สามารถเข้าถึงบัญชีผู้ใช้ Management Console ที่มีบทบาทผู้แก้ไขเพื่อเพิ่มสิทธิ์ผ่านการแทรกคำสั่ง</p><p> การพัฒนานี้เกิดขึ้นเกือบหนึ่งปีหลังจากที่บริษัทได้ดำเนินการขั้นตอนที่ใช้เพื่อรักษาความปลอดภัยการดำเนินงาน Git &quot;ด้วยความระมัดระวังอย่างยิ่ง&quot; หลังจากถูกเปิดเผยในช่วงเวลาสั้น ๆ ในพื้นที่เก็บข้อมูลสาธารณะ</p>"
  },
  {
    "id": "_cryyrkoib",
    "category": "Home",
    "title": "New iShutdown Method Exposes Hidden Spyware Like Pegasus on Your iPhone",
    "date": "Jan 17, 2024",
    "author": "Newsroom",
    "pTags": "Spyware / Forensic Analysis",
    "imgLinks": [
      "iphone-hacking.jpg"
    ],
    "contentEn": "\nCybersecurity researchers have identified a \"lightweight method\" called iShutdown for reliably identifying signs of spyware on Apple iOS devices, including notorious threats like NSO Group's Pegasus, QuaDream's Reign, and Intellexa's Predator. \nKaspersky, which analyzed a set of iPhones that were compromised with Pegasus, said the infections left traces in a file named \"Shutdown.log,\" a text-based system log file available on all iOS devices and which records every reboot event alongside its environment characteristics.\n\n\"Compared to more time-consuming acquisition methods like forensic device imaging or a full iOS backup, retrieving the Shutdown.log file is rather straightforward,\" security researcher Maher Yamout said. \"The log file is stored in a sysdiagnose (sysdiag) archive.\"\nThe Russian cybersecurity firm said it identified entries in the log file that recorded instances where \"sticky\" processes, such as those associated with the spyware, caused a reboot delay, in some cases observing Pegasus-related processes in over four reboot delay notices.\nWhat's more, the investigation revealed a the presence of a similar filesystem path that's used by all the three spyware families – \"/private/var/db/\" for Pegasus and Reign, and \"/private/var/tmp/\" for Predator – thereby acting as an indicator of compromise.\n\nThat said, the success of this approach hinges on a caveat that the target user reboots their device as often as possible, the frequency for which varies according to their threat profile.\nKaspersky has also published a collection of Python scripts to extract, analyze, and parse the Shutdown.log in order to extract the reboot stats.\n\"The lightweight nature of this method makes it readily available and accessible,\" Yamout said. \"Moreover, this log file can store entries for several years, making it a valuable forensic artifact for analyzing and identifying anomalous log entries.\"\n\nThe disclosure comes as SentinelOne revealed information stealers targeting macOS such as KeySteal, Atomic, and JaskaGo (aka CherryPie or Gary Stealer) are quickly adapting to circumvent Apple's built-in antivirus technology called XProtect.\n\"Despite solid efforts by Apple to update its XProtect signature database, these rapidly evolving malware strains continue to evade,\" security researcher Phil Stokes said. \"Relying solely on signature-based detection is insufficient as threat actors have the means and motive to adapt at speed.\"\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/new-ishutdown-method-exposes-hidden.html",
    "titleTh": "วิธี iShutdown ใหม่เปิดเผยสปายแวร์ที่ซ่อนอยู่เช่น Pegasus บน iPhone ของคุณ",
    "contentTh": "นักวิจัยด้านความปลอดภัยทางไซเบอร์ได้ระบุ &quot;วิธีการที่มีน้ำหนักเบา&quot; ที่เรียกว่า iShutdown เพื่อระบุสัญญาณของสปายแวร์บนอุปกรณ์ iOS ของ Apple ได้อย่างน่าเชื่อถือ รวมถึงภัยคุกคามที่มีชื่อเสียงเช่น Pegasus ของ NSO Group, Reign ของ QuaDream และ Predator ของ Intellexa Kaspersky ซึ่งวิเคราะห์ชุด iPhone ที่ถูกบุกรุกโดย Pegasus กล่าวว่าการติดไวรัสทิ้งร่องรอยไว้ในไฟล์ชื่อ &quot;Shutdown.log&quot; ซึ่งเป็นไฟล์บันทึกระบบแบบข้อความที่มีอยู่ในอุปกรณ์ iOS ทั้งหมด และบันทึกทุกเหตุการณ์การรีบูตควบคู่ไปกับสภาพแวดล้อมของมัน ลักษณะเฉพาะ. “เมื่อเทียบกับวิธีการได้มาซึ่งใช้เวลานานกว่า เช่น การสร้างภาพอุปกรณ์ทางนิติเวชหรือการสำรองข้อมูล iOS เต็มรูปแบบ การเรียกค้นไฟล์ Shutdown.log นั้นค่อนข้างตรงไปตรงมา” นักวิจัยด้านความปลอดภัย Maher Yamout กล่าว &quot;ไฟล์บันทึกถูกเก็บไว้ในไฟล์เก็บถาวร sysdiagnose (sysdiag)&quot; บริษัทรักษาความปลอดภัยทางไซเบอร์ของรัสเซียกล่าวว่า ได้ระบุรายการในไฟล์บันทึกที่บันทึกกรณีที่กระบวนการ &quot;เหนียว&quot; เช่น กระบวนการที่เกี่ยวข้องกับสปายแวร์ ทำให้เกิดความล่าช้าในการรีบูต ในบางกรณีได้สังเกตกระบวนการที่เกี่ยวข้องกับ Pegasus ในการแจ้งเตือนการหน่วงเวลาการรีบูตมากกว่าสี่ครั้ง ยิ่งไปกว่านั้น การสืบสวนพบว่ามีพาธของระบบไฟล์ที่คล้ายกันซึ่งใช้โดยสปายแวร์ทั้งสามตระกูล – &quot;/private/var/db/&quot; สำหรับ Pegasus และ Reign และ &quot;/private/var/tmp/&quot; สำหรับ Predator – จึงทำหน้าที่เป็นตัวบ่งชี้การประนีประนอม อย่างไรก็ตาม ความสำเร็จของแนวทางนี้ขึ้นอยู่กับคำเตือนว่าผู้ใช้เป้าหมายจะรีบูทอุปกรณ์ของตนบ่อยที่สุดเท่าที่จะเป็นไปได้ โดยความถี่จะแตกต่างกันไปตามโปรไฟล์ภัยคุกคาม Kaspersky ยังได้เผยแพร่ชุดสคริปต์ Python เพื่อแยก วิเคราะห์ และแยกวิเคราะห์ Shutdown.log เพื่อแยกสถิติการรีบูต “ลักษณะที่ไม่ซับซ้อนของวิธีนี้ทำให้พร้อมใช้งานและเข้าถึงได้” Yamout กล่าว &quot;ยิ่งกว่านั้น ไฟล์บันทึกนี้สามารถจัดเก็บรายการต่างๆ ได้เป็นเวลาหลายปี ทำให้เป็นสิ่งประดิษฐ์ทางนิติวิทยาศาสตร์ที่มีคุณค่าสำหรับการวิเคราะห์และระบุรายการบันทึกที่ผิดปกติ&quot; การเปิดเผยดังกล่าวเกิดขึ้นเมื่อ SentinelOne เปิดเผยผู้ขโมยข้อมูลที่กำหนดเป้าหมายไปที่ macOS เช่น KeySteal, Atomic และ JaskaGo (aka CherryPie หรือ Gary Stealer) กำลังปรับตัวอย่างรวดเร็วเพื่อหลีกเลี่ยงเทคโนโลยีป้องกันไวรัสในตัวของ Apple ที่เรียกว่า XProtect “แม้ว่า Apple จะพยายามอย่างแข็งขันในการอัปเดตฐานข้อมูลลายเซ็น XProtect แต่สายพันธุ์มัลแวร์ที่พัฒนาอย่างรวดเร็วเหล่านี้ยังคงหลบเลี่ยง” Phil Stokes นักวิจัยด้านความปลอดภัยกล่าว “การใช้การตรวจจับตามลายเซ็นเพียงอย่างเดียวนั้นไม่เพียงพอ เนื่องจากผู้คุกคามมีหนทางและแรงจูงใจในการปรับตัวอย่างรวดเร็ว”"
  },
  {
    "id": "_8chm4n72r",
    "category": "Home",
    "title": "GitHub Rotates Keys After High-Severity Vulnerability Exposes Credentials",
    "date": "Jan 17, 2024",
    "author": "Newsroom",
    "pTags": "Vulnerability / Software Security",
    "imgLinks": [
      "github.jpg"
    ],
    "contentEn": "\nGitHub has revealed that it has rotated some keys in response to a security vulnerability that could be potentially exploited to gain access to credentials within a production container.\nThe Microsoft-owned subsidiary said it was made aware of the problem on December 26, 2023, and that it addressed the issue the same day, in addition to rotating all potentially exposed credentials out of an abundance of caution.\nThe rotated keys include the GitHub commit signing key as well as GitHub Actions, GitHub Codespaces, and Dependabot customer encryption keys, necessitating users who rely on these keys to import the new ones.\n\nThere is no evidence that the high-severity vulnerability, tracked as CVE-2024-0200 (CVSS score: 7.2), has been previously found and exploited in the wild.\n\"This vulnerability is also present on GitHub Enterprise Server (GHES),\" GitHub's Jacob DePriest said. \"However, exploitation requires an authenticated user with an organization owner role to be logged into an account on the GHES instance, which is a significant set of mitigating circumstances to potential exploitation.\"\nIn a separate advisory, GitHub characterized the vulnerability as a case of \"unsafe reflection\" GHES that could lead to reflection injection and remote code execution. It has been patched in GHES versions 3.8.13, 3.9.8, 3.10.5, and 3.11.3.\n\nAlso addressed by GitHub is another high-severity bug tracked as CVE-2024-0507 (CVSS score: 6.5), which could permit an attacker with access to a Management Console user account with the editor role to escalate privileges via command injection.\nThe development comes nearly a year after the company took the step of replacing its RSA SSH host key used to secure Git operations \"out of an abundance of caution\" after it was briefly exposed in a public repository.\n\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/github-rotates-keys-after-high-severity.html",
    "titleTh": "GitHub หมุนเวียนคีย์หลังจากช่องโหว่ที่มีความรุนแรงสูงเปิดเผยข้อมูลประจำตัว",
    "contentTh": "GitHub ได้เปิดเผยว่าได้หมุนเวียนคีย์บางตัวเพื่อตอบสนองต่อช่องโหว่ด้านความปลอดภัยที่อาจนำไปใช้ประโยชน์เพื่อเข้าถึงข้อมูลประจำตัวภายในคอนเทนเนอร์ที่ใช้งานจริง บริษัทในเครือของ Microsoft กล่าวว่าได้รับทราบปัญหาแล้วเมื่อวันที่ 26 ธันวาคม 2023 และได้แก้ไขปัญหาดังกล่าวในวันเดียวกัน นอกเหนือจากการหมุนเวียนข้อมูลประจำตัวที่อาจเปิดเผยทั้งหมดโดยใช้ความระมัดระวังอย่างยิ่ง คีย์ที่หมุนเวียนประกอบด้วยคีย์การลงนาม GitHub เช่นเดียวกับ GitHub Actions, GitHub Codespaces และคีย์การเข้ารหัสลูกค้า Dependabot ซึ่งจำเป็นต้องมีผู้ใช้ที่ต้องอาศัยคีย์เหล่านี้เพื่อนำเข้าคีย์ใหม่ ไม่มีหลักฐานว่าช่องโหว่ที่มีความรุนแรงสูง ซึ่งติดตามได้ใน CVE-2024-0200 (คะแนน CVSS: 7.2) ได้ถูกค้นพบและนำไปใช้ประโยชน์แล้วก่อนหน้านี้ในป่า “ช่องโหว่นี้ยังปรากฏอยู่ใน GitHub Enterprise Server (GHES)” Jacob DePriest จาก GitHub กล่าว &quot;อย่างไรก็ตาม การแสวงหาประโยชน์จำเป็นต้องมีผู้ใช้ที่ได้รับการตรวจสอบสิทธิ์ซึ่งมีบทบาทเป็นเจ้าขององค์กรเพื่อเข้าสู่ระบบบัญชีบนอินสแตนซ์ GHES ซึ่งเป็นชุดสำคัญในการบรรเทาสถานการณ์ที่นำไปสู่การแสวงหาประโยชน์ที่อาจเกิดขึ้น&quot; ในคำแนะนำที่แยกออกมา GitHub ระบุลักษณะช่องโหว่ว่าเป็นกรณีของ GHES &quot;การสะท้อนที่ไม่ปลอดภัย&quot; ซึ่งอาจนำไปสู่การแทรกการสะท้อนและการเรียกใช้โค้ดจากระยะไกล ได้รับการแก้ไขแล้วใน GHES เวอร์ชัน 3.8.13, 3.9.8, 3.10.5 และ 3.11.3 นอกจากนี้ GitHub ยังแก้ไขข้อบกพร่องที่มีความรุนแรงสูงอีกประการหนึ่งที่ติดตามได้ใน CVE-2024-0507 (คะแนน CVSS: 6.5) ซึ่งอาจอนุญาตให้ผู้โจมตีสามารถเข้าถึงบัญชีผู้ใช้ Management Console ที่มีบทบาทผู้แก้ไขเพื่อเพิ่มสิทธิ์ผ่านการแทรกคำสั่ง การพัฒนานี้เกิดขึ้นเกือบหนึ่งปีหลังจากที่บริษัทได้ดำเนินการเปลี่ยนรหัสโฮสต์ RSA SSH ที่ใช้ในการรักษาความปลอดภัยการดำเนินงาน Git &quot;โดยใช้ความระมัดระวังอย่างมาก&quot; หลังจากที่เปิดเผยในช่วงสั้น ๆ ในพื้นที่เก็บข้อมูลสาธารณะ"
  },
  {
    "id": "_881pm2e0f",
    "category": "Home",
    "title": "Citrix, VMware, and Atlassian Hit with Critical Flaws — Patch ASAP!",
    "date": "Jan 17, 2024",
    "author": "Newsroom",
    "pTags": "Vulnerability / Cyber Threat",
    "imgLinks": [
      "vulnerability.jpg"
    ],
    "contentEn": "\nCitrix is warning of two zero-day security vulnerabilities in NetScaler ADC (formerly Citrix ADC) and NetScaler Gateway (formerly Citrix Gateway) that are being actively exploited in the wild.\nThe flaws are listed below -\n\nCVE-2023-6548 (CVSS score: 5.5) - Authenticated (low privileged) remote code execution on Management Interface (requires access to NSIP, CLIP, or SNIP with management interface access)\nCVE-2023-6549 (CVSS score: 8.2) - Denial-of-service (requires that the appliance be configured as a Gateway or authorization and accounting, or AAA, virtual server)\n\nThe following customer-managed versions of NetScaler ADC and NetScaler Gateway are impacted by the shortcomings -\n\nNetScaler ADC and NetScaler Gateway 14.1 before 14.1-12.35\nNetScaler ADC and NetScaler Gateway 13.1 before 13.1-51.15\nNetScaler ADC and NetScaler Gateway 13.0 before 13.0-92.21\nNetScaler ADC and NetScaler Gateway version 12.1 (currently end-of-life)\nNetScaler ADC 13.1-FIPS before 13.1-37.176\nNetScaler ADC 12.1-FIPS before 12.1-55.302, and\nNetScaler ADC 12.1-NDcPP before 12.1-55.302\n\n\"Exploits of these CVEs on unmitigated appliances have been observed,\" Citrix said, without sharing any additional specifics. Users of NetScaler ADC and NetScaler Gateway version 12.1 are recommended to upgrade their appliances to a supported version that patches the flaws.\n\nIt's also advised to not expose the management interface to the internet to reduce the risk of exploitation.\nIn recent months, multiple security vulnerabilities in Citrix appliances (CVE-2023-3519 and CVE-2023-4966) have been weaponized by threat actors to drop web shells and hijack existing authenticated sessions.\nVMware Fixes Critical Aria Automation Flaw#\nThe disclosure comes as VMware alerted customers of a critical security vulnerability in Aria Automation (previously vRealize Automation) that could allow an authenticated attacker to gain unauthorized access to remote organizations and workflows.\nThe issue has been assigned the CVE identifier CVE-2023-34063 (CVSS score: 9.9), with the Broadcom-owned virtualization services provider describing it as a \"missing access control\" flaw.\nCommonwealth Scientific and Industrial Research Organization's (CSIRO) Scientific Computing Platforms team has been credited with discovering and reporting the security vulnerability.\nThe versions impacted by the vulnerability are provided below -\n\nVMware Aria Automation (8.11.x, 8.12.x, 8.13.x, and 8.14.x)VMware Cloud Foundation (4.x and 5.x)\n\"The only supported upgrade path after applying the patch is to version 8.16,\" VMware said. \"If you upgrade to an intermediate version, the vulnerability will be reintroduced, requiring an additional round of patching.\"\nAtlassian Discloses Critical Code Execution Bug#\nThe development also follows Atlassian's release of patches for over two dozen vulnerabilities, including a critical remote code execution (RCE) flaw impacting Confluence Data Center and Confluence Server.\n\nThe vulnerability, CVE-2023-22527, has been assigned a CVSS score of 10.0, indicating maximum severity. It affects versions 8.0.x, 8.1.x, 8.2.x, 8.3.x, 8.4.x, and 8.5.0-8.5.3. It's worth noting that 7.19.x LTS versions are not affected by the vulnerability.\n\"A template injection vulnerability on out-of-date versions of Confluence Data Center and Server allows an unauthenticated attacker to achieve RCE on an affected version,\" the Australian company said.\nThe issue has been addressed in versions 8.5.4, 8.5.5 (Confluence Data Center and Server), 8.6.0, 8.7.1, and 8.7.2 (Data Center only). Users who are on out-of-date instances are recommended to update their installations to the latest version available. \n\n\n",
    "ref": "https://thehackernews.com/2024/01/citrix-vmware-and-atlassian-hit-with.html",
    "titleTh": "Citrix, VMware และ Atlassian พบกับข้อบกพร่องที่สำคัญ — แพทช์โดยเร็วที่สุด!",
    "contentTh": "Citrix กำลังเตือนถึงช่องโหว่ด้านความปลอดภัยแบบ Zero-day สองช่องโหว่ใน NetScaler ADC (เดิมคือ Citrix ADC) และ NetScaler Gateway (เดิมคือ Citrix Gateway) ที่กำลังถูกโจมตีอย่างแข็งขันในป่า ข้อบกพร่องมีการระบุไว้ด้านล่าง - CVE-2023-6548 (คะแนน CVSS: 5.5) - การเรียกใช้โค้ดระยะไกลที่ผ่านการรับรองความถูกต้อง (มีสิทธิ์ต่ำ) บนอินเทอร์เฟซการจัดการ (ต้องเข้าถึง NSIP, CLIP หรือ SNIP ด้วยการเข้าถึงอินเทอร์เฟซการจัดการ) CVE-2023-6549 (คะแนน CVSS: 8.2) - การปฏิเสธการให้บริการ (กำหนดให้อุปกรณ์ได้รับการกำหนดค่าเป็นเกตเวย์หรือการอนุญาตและการบัญชี หรือ AAA เซิร์ฟเวอร์เสมือน) NetScaler ADC และ NetScaler Gateway เวอร์ชันที่จัดการโดยลูกค้าต่อไปนี้ได้รับผลกระทบจากข้อบกพร่อง - NetScaler ADC และ NetScaler Gateway 14.1 ก่อน 14.1-12.35 น. NetScaler ADC และ NetScaler Gateway 13.1 ก่อน 13.1-51.15 NetScaler ADC และ NetScaler Gateway 13.0 ก่อน 13.0-92.21 NetScaler ADC และ NetScaler Gateway เวอร์ชัน 12.1 (ปัจจุบันหมดอายุการใช้งาน) NetScaler ADC 13.1-FIPS ก่อน 13.1-37.176 NetScaler ADC 12.1-FIPS ก่อน 12.1-55.302 และ NetScaler ADC 12.1-NDcPP ก่อน 12.1-55.302 “มีการพบเห็นการใช้ประโยชน์จาก CVE เหล่านี้กับอุปกรณ์ที่ไม่มีการบรรเทาผลกระทบ” Citrix กล่าว โดยไม่เปิดเผยข้อมูลเฉพาะเจาะจงเพิ่มเติมใดๆ ขอแนะนำให้ผู้ใช้ NetScaler ADC และ NetScaler Gateway เวอร์ชัน 12.1 อัปเกรดอุปกรณ์เป็นเวอร์ชันที่รองรับซึ่งจะแก้ไขข้อบกพร่อง ไม่แนะนำให้เปิดเผยอินเทอร์เฟซการจัดการกับอินเทอร์เน็ตเพื่อลดความเสี่ยงในการถูกเอารัดเอาเปรียบ ในช่วงไม่กี่เดือนที่ผ่านมา ช่องโหว่ด้านความปลอดภัยหลายจุดในอุปกรณ์ Citrix (CVE-2023-3519 และ CVE-2023-4966) ได้รับการติดอาวุธโดยผู้คุกคามเพื่อทิ้ง Web Shell และจี้เซสชันการรับรองความถูกต้องที่มีอยู่ VMware แก้ไขข้อบกพร่องที่สำคัญของระบบอัตโนมัติ Aria # การเปิดเผยดังกล่าวเกิดขึ้นเมื่อ VMware แจ้งเตือนลูกค้าถึงช่องโหว่ด้านความปลอดภัยที่สำคัญใน Aria Automation (ก่อนหน้านี้เรียกว่า vRealize Automation) ซึ่งอาจทำให้ผู้โจมตีที่ได้รับการตรวจสอบสิทธิ์เข้าถึงองค์กรและเวิร์กโฟลว์ระยะไกลโดยไม่ได้รับอนุญาต ปัญหานี้ได้รับการกำหนดรหัส CVE CVE-2023-34063 (คะแนน CVSS: 9.9) โดยผู้ให้บริการระบบเสมือนที่ Broadcom เป็นเจ้าของอธิบายว่าเป็นข้อบกพร่อง &quot;การควบคุมการเข้าถึงที่ขาดหายไป&quot; ทีมแพลตฟอร์มคอมพิวเตอร์ทางวิทยาศาสตร์ขององค์กรวิจัยวิทยาศาสตร์และอุตสาหกรรมแห่งเครือจักรภพ (CSIRO) ได้รับเครดิตในการค้นพบและรายงานช่องโหว่ด้านความปลอดภัย เวอร์ชันที่ได้รับผลกระทบจากช่องโหว่มีดังต่อไปนี้ - VMware Aria Automation (8.11.x, 8.12.x, 8.13.x และ 8.14.x)VMware Cloud Foundation (4.x และ 5.x) “เส้นทางอัปเกรดเดียวที่รองรับหลังจากใช้แพตช์คือเวอร์ชัน 8.16” VMware กล่าว &quot;หากคุณอัปเกรดเป็นเวอร์ชันกลาง ช่องโหว่ดังกล่าวจะถูกนำกลับมาใช้ใหม่ โดยต้องมีการแพตช์เพิ่มเติม&quot; Atlassian เปิดเผย Bug# การเรียกใช้โค้ดที่สำคัญ การพัฒนายังเป็นไปตามการเปิดตัวแพตช์ของ Atlassian สำหรับช่องโหว่มากกว่าสองโหล รวมถึงข้อบกพร่องการเรียกใช้โค้ดจากระยะไกลที่สำคัญ (RCE) ที่ส่งผลกระทบต่อ Confluence Data Center และ Confluence Server ช่องโหว่ CVE-2023-22527 ได้รับการกำหนดคะแนน CVSS ไว้ที่ 10.0 ซึ่งบ่งชี้ถึงระดับความรุนแรงสูงสุด มีผลกับเวอร์ชัน 8.0.x, 8.1.x, 8.2.x, 8.3.x, 8.4.x และ 8.5.0-8.5.3 เป็นที่น่าสังเกตว่าเวอร์ชัน 7.19.x LTS ไม่ได้รับผลกระทบจากช่องโหว่นี้ “ช่องโหว่การแทรกเทมเพลตใน Confluence Data Center และ Server เวอร์ชันล้าสมัยทำให้ผู้โจมตีที่ไม่ได้รับการรับรองความถูกต้องสามารถเข้าถึง RCE ในเวอร์ชันที่ได้รับผลกระทบ” บริษัทในออสเตรเลียกล่าว ปัญหานี้ได้รับการแก้ไขแล้วในเวอร์ชัน 8.5.4, 8.5.5 (Confluence Data Center and Server), 8.6.0, 8.7.1 และ 8.7.2 (Data Center เท่านั้น) ขอแนะนำให้ผู้ใช้ที่อยู่ในอินสแตนซ์ที่ล้าสมัยอัปเดตการติดตั้งเป็นเวอร์ชันล่าสุดที่มีอยู่"
  },
  {
    "id": "_2jjyn53r9",
    "category": "Home",
    "title": "Zero-Day Alert: Update Chrome Now to Fix New Actively Exploited Vulnerability",
    "date": "Jan 17, 2024",
    "author": "Newsroom",
    "pTags": "Browser Security / Vulnerability",
    "imgLinks": [
      "chrome-0day.jpg"
    ],
    "contentEn": "\nGoogle on Tuesday released updates to fix four security issues in its Chrome browser, including an actively exploited zero-day flaw.\nThe issue, tracked as CVE-2024-0519, concerns an out-of-bounds memory access in the V8 JavaScript and WebAssembly engine, which can be weaponized by threat actors to trigger a crash.\n\"By reading out-of-bounds memory, an attacker might be able to get secret values, such as memory addresses, which can be bypass protection mechanisms such as ASLR in order to improve the reliability and likelihood of exploiting a separate weakness to achieve code execution instead of just denial of service,\" according to MITRE's Common Weakness Enumeration (CWE). \nAdditional details about the nature of the attacks and the threat actors that may be exploiting them have withheld in an attempt to prevent further exploitation. The issue was reported anonymously on January 11, 2024.\n\"Out-of-bounds memory access in V8 in Google Chrome prior to 120.0.6099.224 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page,\" reads a description of the flaw on the NIST's National Vulnerability Database (NVD).\nThe development marks the first actively exploited zero-day to be patched by Google in Chrome in 2024. Last year, the tech giant resolved a total of 8 such actively exploited zero-days in the browser.\nUsers are recommended to upgrade to Chrome version 120.0.6099.224/225 for Windows, 120.0.6099.234 for macOS, and 120.0.6099.224 for Linux to mitigate potential threats.\nUsers of Chromium-based browsers such as Microsoft Edge, Brave, Opera, and Vivaldi are also advised to apply the fixes as and when they become available. \n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/zero-day-alert-update-chrome-now-to-fix.html",
    "titleTh": "การแจ้งเตือนแบบ Zero-Day: อัปเดต Chrome ทันทีเพื่อแก้ไขช่องโหว่ใหม่ที่ถูกใช้ประโยชน์อย่างแข็งขัน",
    "contentTh": "เมื่อวันอังคาร Google ได้เปิดตัวการอัปเดตเพื่อแก้ไขปัญหาด้านความปลอดภัยสี่ประการในเบราว์เซอร์ Chrome รวมถึงข้อบกพร่องแบบซีโรเดย์ที่ถูกเอาเปรียบอย่างแข็งขัน ปัญหานี้ติดตามในชื่อ CVE-2024-0519 เกี่ยวข้องกับการเข้าถึงหน่วยความจำนอกขอบเขตในกลไก V8 JavaScript และ WebAssembly ซึ่งสามารถติดอาวุธโดยผู้คุกคามเพื่อกระตุ้นให้เกิดการขัดข้อง “ด้วยการอ่านหน่วยความจำนอกขอบเขต ผู้โจมตีอาจสามารถรับค่าที่เป็นความลับ เช่น ที่อยู่หน่วยความจำ ซึ่งสามารถเป็นกลไกการป้องกันแบบบายพาส เช่น ASLR เพื่อปรับปรุงความน่าเชื่อถือและโอกาสในการใช้ประโยชน์จากจุดอ่อนที่แยกจากกันเพื่อให้ได้รหัส การดำเนินการแทนการปฏิเสธการให้บริการเพียงอย่างเดียว&quot; ตามรายงาน Common Weakness Enumeration (CWE) ของ MITRE รายละเอียดเพิ่มเติมเกี่ยวกับลักษณะของการโจมตีและผู้กระทำภัยคุกคามที่อาจแสวงหาผลประโยชน์จากพวกเขาได้ระงับไว้เพื่อพยายามป้องกันการแสวงหาประโยชน์เพิ่มเติม มีการรายงานปัญหานี้โดยไม่เปิดเผยตัวตนเมื่อวันที่ 11 มกราคม 2024 “การเข้าถึงหน่วยความจำนอกขอบเขตใน V8 ใน Google Chrome ก่อน 120.0.6099.224 อนุญาตให้ผู้โจมตีระยะไกลใช้ประโยชน์จากความเสียหายของฮีปผ่านหน้า HTML ที่สร้างขึ้น” อ่านคำอธิบายของข้อบกพร่องในฐานข้อมูลช่องโหว่แห่งชาติ (NVD) ของ NIST การพัฒนานี้นับเป็นครั้งแรกที่ Google ได้ทำการแพตช์ Zero-day ที่มีการใช้ประโยชน์อย่างแข็งขันใน Chrome ในปี 2024 เมื่อปีที่แล้ว บริษัทยักษ์ใหญ่ด้านเทคโนโลยีได้แก้ไขปัญหา Zero-Day ที่มีการใช้ประโยชน์อย่างแข็งขันดังกล่าวทั้งหมด 8 รายการในเบราว์เซอร์ ขอแนะนำให้ผู้ใช้อัปเกรดเป็น Chrome เวอร์ชัน 120.0.6099.224/225 สำหรับ Windows, 120.0.6099.234 สำหรับ macOS และ 120.0.6099.224 สำหรับ Linux เพื่อบรรเทาภัยคุกคามที่อาจเกิดขึ้น ผู้ใช้เบราว์เซอร์ที่ใช้ Chromium เช่น Microsoft Edge, Brave, Opera และ Vivaldi ควรใช้การแก้ไขเมื่อและเมื่อพร้อมใช้งาน"
  },
  {
    "id": "_tfxv9tzeo",
    "category": "Home",
    "title": "Webinar: The Art of Privilege Escalation - How Hackers Become Admins",
    "date": "2024-01-17T16:29:00+05:30",
    "author": "The Hacker News",
    "pTags": "Cyber Threat / Live Webinar",
    "imgLinks": [
      "_e63wjewcf"
    ],
    "contentEn": "<p>In the digital age, the battleground for security professionals is not only evolving, it's expanding at an alarming rate. The upcoming webinar, \",\" offers an unmissable opportunity for IT security experts to stay ahead in this relentless cyber war.</p><p>Privilege escalation - the term might sound benign, but in the hands of a skilled hacker, it's a devastating tactic. It's a method where cyber attackers, starting as standard users, clandestinely climb the ladder of access, eventually gaining root-level control.</p><p>This isn't just a breach; it's a systematic takeover of your entire network. Picture a scenario where cybercriminals roam freely through your network, turning your layers of defense into mere spectators. It's a chilling thought, but it's a reality faced by organizations across the globe.</p><p>What if you could anticipate and counter these threats? Expertly delivered by <b>Joseph Carson</b>, Chief Security Scientist (CSS) &amp; Advisory CISO at <b>Delinea</b>,  aims to turn the tables on cyber attackers.</p><p>It's not just a webinar; it's your step towards transforming your approach to digital security. Take advantage of this chance to be at the forefront of cybersecurity defense.</p><p>Join us and be part of an eye-opening session that empowers you to protect your organization against sophisticated cyber threats.</p><p></p><p>See you there!</p>",
    "ref": "https://thehackernews.com/2024/01/webinar-art-of-privilege-escalation-how.html",
    "titleTh": "การสัมมนาผ่านเว็บ: ศิลปะแห่งการยกระดับสิทธิ์ - วิธีที่แฮกเกอร์มาเป็นผู้ดูแลระบบ",
    "contentTh": "<p>ในยุคดิจิทัล สมรภูมิสำหรับผู้เชี่ยวชาญด้านความปลอดภัยไม่เพียงแต่พัฒนาเท่านั้น แต่ยังขยายตัวในอัตราที่น่าตกใจอีกด้วย การสัมมนาผ่านเว็บที่กำลังจะมาถึง &quot;,&quot; มอบโอกาสที่ไม่ควรพลาดสำหรับผู้เชี่ยวชาญด้านความปลอดภัยด้านไอทีในการก้าวนำหน้าในสงครามไซเบอร์ที่ไม่หยุดหย่อนนี้</p><p> การเพิ่มสิทธิพิเศษ - คำนี้อาจฟังดูไม่สุภาพ แต่ในมือของแฮ็กเกอร์ผู้มีทักษะ มันเป็นกลยุทธ์ที่ทำลายล้าง เป็นวิธีการที่ผู้โจมตีทางไซเบอร์ซึ่งเริ่มต้นในฐานะผู้ใช้มาตรฐาน แอบไต่ระดับการเข้าถึงอย่างลับๆ และในที่สุดก็ได้รับการควบคุมระดับรูท</p><p> นี่ไม่ใช่แค่การละเมิดเท่านั้น เป็นการครอบครองเครือข่ายทั้งหมดของคุณอย่างเป็นระบบ ลองนึกภาพสถานการณ์ที่อาชญากรไซเบอร์ท่องไปอย่างอิสระผ่านเครือข่ายของคุณ เปลี่ยนชั้นการป้องกันของคุณให้เป็นเพียงผู้ชม เป็นความคิดที่น่าขนลุก แต่เป็นความจริงที่องค์กรต่างๆ ทั่วโลกต้องเผชิญ</p><p> จะเป็นอย่างไรหากคุณสามารถคาดการณ์และตอบโต้ภัยคุกคามเหล่านี้ได้ นำเสนอโดยผู้เชี่ยวชาญโดย <b>Joseph Carson</b> หัวหน้านักวิทยาศาสตร์ด้านความปลอดภัย (CSS) และ CISO ที่ปรึกษาของ <b>Delinea</b> มีเป้าหมายที่จะพลิกสถานการณ์กับผู้โจมตีทางไซเบอร์</p><p> ไม่ใช่แค่การสัมมนาผ่านเว็บเท่านั้น เป็นก้าวของคุณสู่การเปลี่ยนแปลงแนวทางสู่การรักษาความปลอดภัยทางดิจิทัล ใช้ประโยชน์จากโอกาสนี้เพื่อเป็นผู้นำในการป้องกันความปลอดภัยทางไซเบอร์</p><p> เข้าร่วมกับเราและเป็นส่วนหนึ่งของเซสชั่นเปิดหูเปิดตาที่จะช่วยให้คุณปกป้ององค์กรของคุณจากภัยคุกคามทางไซเบอร์ที่ซับซ้อน</p><p></p><p> แล้วเจอกัน!</p>"
>>>>>>> 6cc5e29ee0d2bc585a055d2449c1e6ce311de0ef
  }
]